# GroupBy

In [2]:
import pandas as pd
g=pd.DataFrame({"Name":["a","b","c","a","b","c","c","b"],"S_1":[1,2,3,4,5,6,7,8],"S_2":[11,22,33,44,55,66,77,88]})
g

  Name  S_1  S_2
0    a    1   11
1    b    2   22
2    c    3   33
3    a    4   44
4    b    5   55
5    c    6   66
6    c    7   77
7    b    8   88

In [3]:
g1=g.groupby("Name")
g1

In [5]:
for x,y in g1:
    print(x)
    print(y)
    print()

a
  Name  S_1  S_2
0    a    1   11
3    a    4   44

b
  Name  S_1  S_2
1    b    2   22
4    b    5   55
7    b    8   88

c
  Name  S_1  S_2
2    c    3   33
5    c    6   66
6    c    7   77

In [10]:
g=pd.DataFrame({"Name":["a","b","c","a","b","c","c","b"],"S_1":[1,2,3,4,5,6,7,8],"S_2":[11,22,33,44,55,66,77,88]})
g1.get_group("a")

  Name  S_1  S_2
0    a    1   11
3    a    4   44

In [11]:
 g1.min()

      S_1  S_2
Name
a       1   11
b       2   22
c       3   33

In [12]:
g1.max()

      S_1  S_2
Name
a       4   44
b       8   88
c       7   77

In [13]:
g1.mean()

           S_1        S_2
Name
a     2.500000  27.500000
b     5.000000  55.000000
c     5.333333  58.666667

In [15]:
l=list(g1)
l

[('a',
    Name  S_1  S_2
  0    a    1   11
  3    a    4   44),
 ('b',
    Name  S_1  S_2
  1    b    2   22
  4    b    5   55
  7    b    8   88),
 ('c',
    Name  S_1  S_2
  2    c    3   33
  5    c    6   66
  6    c    7   77)]